<template>
  <div class="modal-overlay" @click.self="$emit('close')">
    <div class="modal-content" >
      <button class="close-button" @click="$emit('close')">&times;</button>
      <div class="modal-scrollable">
        <h1 class="contract-title">ДОГОВОР НА ПРЕДОСТАВЛЕНИЕ УСЛУГ</h1>
    <p class="contract-date">г. Москва «26» декабря 2024 года</p>
    <p>
      Индивидуальный предприниматель Богатырев Тихон Константинович, именуемый в дальнейшем "Исполнитель",
      действующий на основании записи в ЕГРИП от __.__.__ за ОГРНИП 317344300073052, предлагает любому
      дееспособному физическому лицу, в дальнейшем именуемому «Клиент», заключить договор на указанных ниже
      условиях.
    </p>
    <p>
      Настоящее предложение, в соответствии с п.2 ст. 437 Гражданского кодекса РФ является Публичной офертой
      (далее – Договор), полным и безоговорочным принятием (акцептом) условий которой в соответствии со ст. 438
      Гражданского кодекса РФ является осуществление Клиентом первой оплаты предложенных Исполнителем услуг
      в порядке, определенном настоящим Договором.
    </p>
    <p>
      Акцепт оферты означает, что Клиент согласен со всеми положениями настоящего предложения, и равносилен
      заключению договора об оказании услуг. Датой заключения договора считается дата оформления заказа.
    </p>
    <p>
      Акцептируя данную оферту, Клиент подтверждает расторжение ранее заключенных с Исполнителем договоров
      на оказание услуг.
    </p>
    <br>
    <h2>ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
    <p>
      <strong>Сайт</strong> - принадлежащий Исполнителю, содержащий совокупность информации, текстов, графических
      элементов, дизайна, изображений, фото- и видеоматериалов и иных результатов интеллектуальной деятельности, а также
      программ для ЭВМ, содержащихся в информационной системе, обеспечивающей доступность такой информации,
      расположенный в сети Интернет под доменным именем: www.igra-pads.ru
    </p>
    <p>
      <strong>Договор</strong> – настоящий документ, опубликованный в сети Интернет, а также направляемый в целях
      ознакомления посредством электронной почты либо предоставляемый в целях ознакомления любыми другими
      способами.
    </p>
    <p>
      <strong>Квиз (игра)</strong> – игровое интеллектуально-развлекательное мероприятие, командная игра,
      рассчитанная на различное количество человек, проведение которой регулируется специальными правилами,
      размещенными на Сайте.
    </p>
    <p>
      <strong>Клиент</strong> – заказчик услуг, оформивший заявку на Сайте, действующий от своего имени и от имени всех
      привлеченных им участников.
    </p>
    <br>

    <h2>УСЛОВИЯ ОПЛАТЫ</h2>
    <p>3.1. Расчет стоимости заказанных услуг производится в соответствии с утвержденным прейскурантом цен
    Исполнителя, размещенным на главной странице Сайта и в разделе «Расписание игр» при описании каждой
    игры, в зависимости от выбранных Клиентом услуг и количества участников.</p>
    <p>3.2. Стоимость услуг Исполнителя по настоящему Договору указывается на Сайте и может быть изменена
    Исполнителем в любое время в одностороннем порядке. Новая стоимость услуг вступает в силу с момента
    опубликования и не распространяется на оплаченные к моменту опубликования таких изменений услуги.</p>
    <p>3.3. Клиент осуществляет оплату заказанных услуг путем внесения денежных средств в кассу Исполнителя либо
    путем безналичного перечисления денежных средств на расчетный счет Исполнителя, указанный в настоящем
    Договоре.</p>
    <p>3.4. Оплата услуг производится на условиях 100% предоплаты не позднее дня оказания услуги (проведения
    Квиза) в соответствии с действующим на день оплаты прейскурантом цен.</p>
    <p>3.5. Моментом оплаты услуг по Договору считается дата внесения денежных средств в кассу Исполнителя или
    зачисления их на расчетный счет Исполнителя.</p>
    <p>3.6. Услуги считаются оказанными надлежащим образом и принятыми Клиентом, если в
    течение 1 (одного) календарного дня после окончания оказания услуг Исполнитель не получил от
    Клиента письменных мотивированных возражений. По истечении указанного срока претензии в отношении
    недостатков оказанных услуг Исполнителем не принимаются.</p>
    <br>
    <h2>РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</h2>
    <p><strong>ИП Богатырев Тихон Константинович</strong></p>
    <p><strong>ОГРНИП 317344300073052</strong></p>
    <p><strong>ИНН 343534232543</strong></p>
    <p>Адрес: 142720, МО, г.о. Ленинский, г.Видное, рп Дрожжино, ул. Южная, д.11, к.3, кв.156</p>
    <p>Счет № 40802810024820000023</p>
    <p>Наименование банка: ФИЛИАЛ «ЦЕНТРАЛЬНЫЙ» БАНКА ВТБ (ПАО)</p>
    <p>Корр/счет 30101810145250000411</p>
    <p>БИК 044525411</p>

      </div>
    </div>
  </div>
</template>

<script setup>
const props = defineProps({
  close: Function,
});
</script>

<style scoped>
.modal-overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 1000;
}

p {
  font-size: 17px;
}

h2 {
  font-weight: 600;
  margin-top: 18px;
  margin-bottom: 10px;
}
.modal-content {
  background: white;
  border-radius: 23px;
  padding: 58px 68px 40px 66px;
  width: 80%;
  color: #0F1921;
  max-width: 1213px;
  max-height: 595px;
  display: flex;
  flex-direction: column;
  position: relative;
  overflow: hidden;
  text-align: left;
}

.modal-scrollable {
  flex: 1;
  overflow-y: auto;
  text-align: left;
}

.contract-title {
  text-align: left;
  font-size: 18px;
  margin-bottom: 20px;
}

.contract-date {
  text-align: left;
  margin-bottom: 20px;
  margin-top: 25px;
  color: #0F1921;
  font-size: 18px;
}

p {
  font-size: 18px;
}

.close-button {
  position: absolute;
  top: -15px;
  right: 15px;
  background: none;
  border: none;
  font-size: 75px;
  cursor: pointer;
  font-weight: 200;
}

.close-button:hover {
  color: red;
}
</style>
