<template>
  <div class="modal-overlayd" @click.self="$emit('close')">
    <div class="modal-content" >
      <button class="close-button" @click="$emit('close')">&times;</button>
      <div class="modal-scrollable">
        <h1 class="contract-title">ДОГОВОР НА ПРЕДОСТАВЛЕНИЕ УСЛУГ</h1>
    <p class="contract-date">г. Москва «19» февраля 2025 года</p>
    <p>
      Индивидуальный предприниматель Богатырев Тихон Константинович, именуемый в дальнейшем "Исполнитель", действующий на основании записи в ЕГРИП от 04.08.2017 за ОГРНИП 317344300073052, предлагает любому дееспособному физическому лицу, в дальнейшем именуемому «Клиент», заключить договор на указанных ниже условиях.
    </p>
    <br>
    <p>
      Настоящее предложение, в соответствии с п.2 ст. 437 Гражданского кодекса РФ является Публичной офертой (далее – Договор), полным и безоговорочным принятием (акцептом) условий которой в соответствии со ст. 438 Гражданского кодекса РФ является осуществление Клиентом первой оплаты предложенных Исполнителем услуг в порядке, определенном настоящим Договором.
    </p>
    <br>
    <p>
      Акцепт оферты означает, что Клиент согласен со всеми положениями настоящего предложения, и равносилен заключению договора об оказании услуг. Датой заключения договора считается дата оформления заказа.
    </p>
    <br>
    <p>
      Акцептируя данную оферту, Клиент подтверждает расторжение ранее заключенных с Исполнителем договоров на оказание услуг.
    </p>
    <br>
    <h2 style="font-weight: 800;">ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
    <br>
    <p>
      <span style="font-weight: 700;">Сайт</span> - принадлежащий Исполнителю, содержащий совокупность информации, текстов, графических элементов, дизайна, изображений, фото- и видеоматериалов и иных результатов интеллектуальной деятельности, а также программ для ЭВМ, содержащихся в информационной системе, обеспечивающей доступность такой информации, расположенный в сети Интернет под доменным именем <span style="font-weight: 700;">www.igra-pads.ru</span>
    </p>
    <br>
    <p>
      <span style="font-weight: 700;">Договор</span> – настоящий документ, опубликованный в сети Интернет, а также направляемый в целях ознакомления посредством электронной почты либо предоставляемый в целях ознакомления любыми другими способами.
    </p>
    <br>
    <p>
      <span style="font-weight: 700;">Квиз (игра)</span> – игровое интеллектуально-развлекательное мероприятие, командная игра, рассчитанная на различное количество человек, проведение которой регулируется специальными правилами, размещенными в разделе «Правила», ссылка на который расположена на главной странице Cайта www.igra-pads.ru.
    </p>
    <br>
    <p>
      <span style="font-weight: 700;">Клиент</span> – заказчик услуг, оформивший заявку на Сайте, действующий от своего имени и от имени всех привлеченных им участников.
    </p>
    <br>

    <h2 style="font-weight: 700;">1. ПРЕДМЕТ ДОГОВОРА</h2>
    <br>
    <p>1.1. Исполнитель обязуется оказать, а Клиент, являющийся дееспособным физическим лицом,   обязуется  принять  и оплатить на условиях настоящего Договора услуги по организации и проведению интеллектуально-развлекательных мероприятий, сопутствующие и иные услуги (далее – «услуги»).</p>
    <br>
    <p>1.2. На Сайте Клиент имеет возможность ознакомиться с предлагаемыми Исполнителем услугами, в том числе с тематикой Квиза, возрастными ограничениями, стоимостью, датой, временем (продолжительностью) и местом проведения, а также рейтингом команд и иными услугами, предлагаемыми Исполнителем.</p>
    <br>
    <p>1.3. Услуги оказываются Исполнителем на основании выбора Клиента и в соответствии с его заявкой, оформленной на Сайте. При оформлении заявки Клиент осуществляет запись на игру с указанием контактных данных (имя/никнейм/псевдоним), номер телефона, адрес электронной почты), а также  названия команды и количества участников команды.</p>
    <br>
    <h2 style="font-weight: 700;">2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
    <br>
    <p style="font-weight: 700;">2.1. Исполнитель обязан:</p>
    <br>
    <p>2.1.1. Оказывать услуги по настоящему Договору качественно и в сроки, согласованные с Клиентом в соответствующей заявке, в соответствии с правилами проведения игр.</p>
    <br>
    <p>2.1.2. Вести подсчет оказываемым Клиенту услугам, подводить итоги игр, по результатам которых выкладывать на Сайте рейтинг команды Клиента.</p>
    <br>
    <p style="font-weight: 700;">2.2. Исполнитель вправе:</p>
    <br>
    <p>2.2.1. Отказать в предоставлении услуг Клиенту в случаях:</p>
    <p>- не поступления оплаты по выбранной услуге в установленные Договором сроки;</p>
    <p>- нарушения правил проведения игр, например, но не ограничиваясь, если число участников команды Клиента превышает число игроков в соответствии с правилами проведения игр.</p>
    <br>
    <p>2.2.2. Осуществлять фото- и/или видеозапись игр с изображениями участников, распространять (публиковать, размещать на Сайте и в социальных сетях, копировать или передавать третьим лицам для публикации в СМИ) в рекламных целях для продвижения своей коммерческой деятельности, на что Клиент и участники Квиза дают свое согласие.</p>
    <br>
    <p>2.2.3. Изменять условия настоящего Договора в одностороннем порядке без предварительного согласования с Клиентом, путем опубликования новой редакции настоящего Договора на Сайте. Новые условия оказания услуг вступают в силу с даты опубликования на Сайте.</p>
    <br>
    <p>2.2.4. Самостоятельно определять способы и методы оказания услуг.</p>
    <br>
    <p>2.2.5. В любой момент по своему усмотрению приостанавливать оказание услуг с целью предупреждения Клиента и иных участников игры о совершении последними противоправных действий, в том числе, которые
      ведут/могут привести к порче имущества Исполнителя и/или третьих лиц. Настоящим Клиент (участники игры)  соглашается с тем, что период временной остановки соответствующим образом сокращает продолжительность  игры. В указанном случае стоимость услуг перерасчету не подлежит, услуги будут считаться надлежащим образом оказанными.</p>
    <br>
    <p>2.2.6. Прекратить без возобновления оказание услуг (остановить игру) в ситуации намеренной порчи имущества
      Исполнителя и/или третьих лиц Клиентом (участниками игры). В указанном случае стоимость услуг возврату не подлежит, услуги будут считаться надлежащим образом оказанными.</p>
    <br>
    <p>2.2.7. Проводить акции, применять скидки и промокоды при оказании услуг по собственному усмотрению.</p>
    <br>
    <p style="font-weight: 700;">2.3. Клиент обязуется:</p>
    <br>
    <p>2.3.1. Своевременно оплачивать услуги по настоящему Договору.</p>
    <br>
    <p>2.3.2. Своевременно получать оказываемые услуги, а именно организовывать посещение участниками в соответствии с расписанием заказанных игр.</p>
    <br>
    <p>2.3.3. Бережно относиться к имуществу Исполнителя и третьих лиц.</p>
    <br>
    <p>2.3.4. Возместить ущерб, причиненный Клиентом или привлеченными им участниками имуществу Исполнителя или третьих лиц, в течение 5 (пяти) рабочих дней с даты получения соответствующего требования в соответствии с законодательством Российской Федерации.</p>
    <br>
    <p>2.3.5. Соблюдать правила проведения игр и правила внутреннего распорядка в месте проведения игры.</p>
    <br>
    <p>2.3.6. Соглашаться с изменениями в расписании проведения игр, связанными с государственными праздниками и соответствующими им выходными днями и иными обстоятельствами, связанными с изменением режима работы в месте проведения Квиза (оказания услуг).</p>
    <br>
    <p style="font-weight: 700;">2.4. Клиент вправе:</p>
    <br>
    <p>2.4.1. Выбирать и получать услуги, предоставляемые Исполнителем, в соответствии с расписанием и возрастными особенностями, при условии наличия свободных мест.</p>
    <br>
    <p>2.4.2. Расторгнуть Договор, письменно уведомив об этом Исполнителя не менее чем за 3 (три) календарных дня до запланированной даты проведения Квиза (оказания услуг). По истечении указанного срока, отказ от заказанных услуг возможен при условии возмещения Исполнителю расходов на подготовку к оказанию услуг в размере уплаченного аванса.</p>
    <br>
    <p>2.4.3. Получить вводный инструктаж о правилах проведения игры.</p>
    <br>
    <p style="font-weight: 700;">2.5. Клиент не вправе:</p>
    <p>Распространять (публиковать, размещать на интернет-сайтах, копировать, передавать или перепродавать третьим лицам) в коммерческих или некоммерческих целях предоставляемую Исполнителем информацию и материалы в рамках настоящего Договора, создавать на ее основе информационные продукты с целью извлечения коммерческой прибыли, а также использовать эту информацию каким-либо иным образом, кроме как для личного пользования.</p>
    <br>
    <h2 style="font-weight: 700;">3. УСЛОВИЯ ОПЛАТЫ</h2>
    <p>3.1. Расчет стоимости заказанных услуг производится в соответствии с утвержденным прейскурантом цен Исполнителя, размещенным в разделе «Оплата», в зависимости от выбранных Клиентом услуг и количества участников.</p>
    <br>
    <p>3.2. Стоимость услуг Исполнителя по настоящему Договору указывается на Сайте и может быть изменена Исполнителем в любое время в одностороннем порядке. Новая стоимость услуг вступает в силу с момента опубликования и не распространяется на оплаченные к моменту опубликования таких изменений услуги.</p>
    <br>
    <p>3.3. Клиент осуществляет оплату заказанных услуг путем внесения денежных средств в кассу Исполнителя либо путем безналичного перечисления денежных средств на расчетный счет Исполнителя, указанный в настоящем Договоре.</p>
    <br>
    <p>3.4. Оплата услуг производится на условиях 100% предоплаты не позднее дня оказания услуги (проведения Квиза) в соответствии с действующим на день оплаты прейскурантом цен.</p>
    <br>
    <p>3.5. Моментом оплаты услуг по Договору считается дата внесения денежных средств в кассу Исполнителя  или зачисления их на расчетный счет Исполнителя.</p>
    <br>
    <p>3.6. Услуги считаются оказанными надлежащим образом и принятыми Клиентом, если в
течение 1 (одного) календарного дня после окончания оказания услуг Исполнитель не получил от
Клиента письменных мотивированных возражений. По истечении указанного срока претензии в отношении недостатков оказанных услуг Исполнителем не принимаются.</p>
    <br>
    <h2 style="font-weight: 700;">4. ПЕРСОНАЛЬНЫЕ ДАННЫЕ И ИХ ИСПОЛЬЗОВАНИЕ</h2>
    <br>
    <p>4.1. Клиент (участник игры), в соответствии с п. 4 ст. 9 Федерального закона «О персональных данных» от 
27.07.2006 года № 152-ФЗ, дает согласие на использование, обработку, хранение своих 
персональных данных, предоставляемых Исполнителю в рамках настоящего Договора в 
целях оказания услуг, с даты заключения настоящего Договора.</p>
    <br>
    <p>4.2. Обработка персональных данных означает запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных, не подпадающих под специальные категории, на обработку которых, согласно действующему законодательству Российской Федерации, требуется письменное согласие Клиента (участника игры).</p>
    <br>
    <p>4.3. Обработка персональных данных производится в целях исполнения Исполнителем обязательств по настоящему Договору, обеспечения Клиента (участника игры) обратной связью при использовании Сайта, а также в целях направления на указанный Клиентом при заказе услуг адрес электронной почты и/или номер телефона информационных и рекламных сообщений.</p>
    <br>
    <p>4.4. Обработка персональных данных Клиента (участника игры) производится Исполнителем с использованием баз данных, размещенных на территории Российской Федерации.</p>
    <br>
    <p>4.5. Клиент (участник игры) вправе в любое время отозвать согласие на обработку персональных данных, направив Исполнителю соответствующее уведомление на адрес электронной почты msk@thegame.ru</p>
    <br>
    <p>4.6. Клиент (участник игры)  дает согласие на получение информационных рассылок и рекламных материалов от Исполнителя на адрес электронной почты и/или контактный телефон, указанные Клиентом при регистрации на Сайте.</p>
    <br>
    <p>4.7. Согласие на получение информационных рассылок и рекламных материалов может быть отозвано Клиентом (участником игры) в любое время путем направления Исполнителю соответствующего уведомления на адрес электронной почты msk@thegame.ru</p>
    <br>
    <p>4.8. Клиент (участник игры) дают безотзывное и бессрочное согласие на обнародование и дальнейшее использование путем размещения на Сайте и/или в социальных сетях (Telegram, Вконтакте, Instagram (соцсеть запрещена в России)) и/или в средствах массовой информации Исполнителя своих изображений, полученных до, в ходе и после оказания услуг (проведения игры), в порядке, предусмотренном ст. 152.1 Гражданского кодекса Российской Федерации.</p>
    <br>
    <h2 style="font-weight: 700;">5. ЗАЩИТА АВТОРСКИХ ПРАВ</h2>
    <br>
    <p>5.1. Сайт, с которого осуществляется продажа услуг Исполнителя или непосредственное оказание таких услуг, а также сами услуги (игры), содержат результаты интеллектуальной деятельности, принадлежащие Исполнителю, его аффилированным лицам и другим связанным сторонам, представителям, всем прочим лицам, действующим от имени Исполнителя.</p>
    <br>
    <p>5.2. При цитировании материалов Сайта Исполнителя Клиент обязуется указывать ссылку на Сайт.</p>
    <br>
    <p>5.3. В случае нарушения Клиентом положений настоящего Договора, касающихся защиты авторских прав Исполнителя, последний вправе потребовать от Клиента и/или иных участников игры компенсации всех причиненных убытков, включая упущенную выгоду.</p>
    <br>
    <h2 style="font-weight: 700;">6. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
    <p>6.1.Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств по настоящему Договору в соответствии с действующим законодательством Российской Федерации.</p>
    <br>
    <p>6.2. Исполнитель не несет никакой ответственности за вред, причиненный жизни и здоровью Клиента и/или участников игры в случае ненадлежащего исполнения ими обязательств по Договору, нарушения правил проведения игр или правил внутреннего распорядка в месте проведения игры, несоблюдения правил, разъясненных во время вводного инструктажа в соответствии с п. 2.4.3 Договора, а также нарушения иных указаний Исполнителя, которые могут возникнуть во время участия в Квизе. В случае участия в Квесте детей до 18 лет всю ответственность за них и их действия несут их сопровождающие (родители, законные представители либо иные уполномоченные лица).</p>
    <br>
    <p>6.3. Исполнитель не несет ответственности за действия (бездействие) собственника, арендодателя, администрации и сотрудников помещения, в котором Сторонами согласовано оказание услуг в рамках настоящего Договора, а также иных третьих лиц (баров, ресторанов, официантов, фотографов и пр.). </p>
    <br>
    <p>6.4. Исполнитель не несет ответственности в случае, если в ходе оказания услуг Клиенту (участнику игры) будет причинен какой-либо имущественный ущерб или вред личности Клиента (участника игры), кроме случаев причинения такого ущерба/вреда по вине Исполнителя.</p>
    <br>
    <p>6.5. Стороны освобождаются от ответственности в случае возникновения форс-мажорных обстоятельств, то есть событий, которые нельзя было предвидеть или предотвратить разумными мерами. Сторона, у которой возникли такие обстоятельства, должна в разумные сроки и доступным способом оповестить о таких обстоятельствах другую сторону. Извещение должно содержать данные о характере обстоятельств, оценку их влияния на возможность исполнения стороной своих обязательств по настоящему Договору, а также предполагаемые сроки их действия. Если наступившие обстоятельства форс-мажора и их последствия продолжают действовать более одного месяца, Стороны проводят дополнительные переговоры для выявления приемлемых альтернативных способов исполнения настоящего Договора либо настоящий Договор подлежит расторжению по инициативе любой из Сторон.</p>
    <br>
    <p>6.6. В случае возникновения споров или претензий между сторонами по настоящему Договору, стороны будут стремиться урегулировать их путем переговоров, а в случае не достижения согласия, урегулирование споров и претензий осуществляется в порядке, установленном законодательством РФ. При этом претензионный порядок разрешения споров, возникающих из отношений по поводу заключения, исполнения и расторжения настоящего Договора является обязательным. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
    <br>
    <h2 style="font-weight: 700;">7. ПРОЧИЕ УСЛОВИЯ</h2>
    <br>
    <p>7.1. Под рабочими днями в целях настоящего Договора понимаются рабочие дни исходя из пятидневной рабочей недели и не являющиеся нерабочими праздничными днями в соответствии с законодательством Российской Федерации.</p>
    <br>
    <p>7.2. Если иное не определено Договором, обмен информацией (материалами) между Сторонами по настоящему Договору совершается исключительно в письменной форме. Письменные сообщения Сторон (в том числе заказы, их подтверждения, претензии, уведомления и др.) отправляются по почте, электронной почте, курьером, выдаются Стороне (уполномоченному представителю) на руки.</p>
    <br>
    <p>7.3. Стороны обязуются своевременно (не позднее 5 (пяти) дней) уведомлять друг друга об изменении почтовых, банковских, электронных и иных реквизитов. В случае несвоевременного уведомления направленные по прежним реквизитам документы, денежные средства и информация считаются направленными по надлежащему адресу и реквизитам.</p>
    <br>
    <p>7.4. С момента подписания настоящего Договора все предшествующие переговоры, соглашения и переписка Сторон утрачивают силу и не могут использоваться в качестве доказательств в случае спора и для толкования текста настоящего Договора.</p>
    <br>
    <p>7.5. Во всём, что не предусмотрено настоящим Договором, Стороны руководствуются действующим законодательством Российской Федерации.</p>
    <br>
    <h2 style="font-weight: 700;">8. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</h2>
    <p><strong>ИП Богатырев Тихон Константинович</strong></p>
    <br>
    <p><strong>ИНН 343534232543</strong></p>
    <br>
      </div>
    </div>
  </div>
</template>

<script setup>
const props = defineProps({
  close: Function,
});
</script>

<style scoped>
.modal-overlayd {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 1000;
}

p {
  font-size: 24px;
}

h2 {
  font-size: 26px;
  font-weight: 600;
  margin-top: 18px;
  margin-bottom: 10px;
}
.modal-content {
  background: white;
  border-radius: 23px;
  padding: 58px 68px 40px 66px;
  width: 80%;
  color: #0F1921;
  width: 1430px;
  max-height: 750px;
  display: flex;
  flex-direction: column;
  position: relative;
  overflow: hidden;
  text-align: left;
}

.modal-scrollable {
  flex: 1;
  overflow-y: auto;
  text-align: left;
}

.contract-title {
  text-align: left;
  font-size: 28px;
  font-weight: 800;
  margin-bottom: 20px;
}

.contract-date {
  text-align: left;
  margin-bottom: 20px;
  margin-top: 25px;
  color: #0F1921;
  font-size: 24px;
}

p {
  font-size: 24px;
}

.close-button {
  position: absolute;
  top: -15px;
  right: 15px;
  background: none;
  border: none;
  font-size: 75px;
  cursor: pointer;
  font-weight: 200;
}

.close-button:hover {
  color: red;
}
</style>
