<template>
  <div class="modal-overlay" @click.self="$emit('close')">
    <div class="modal-content">
      <button class="close-button" @click="$emit('close')">&times;</button>
      <div class="modal-scrollable">
        <h1 class="privacy-policy-title">Политика конфиденциальности</h1>
        <h2 style="font-weight: 800;">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
        <br>
      <p>1.1.Настоящая Политика о конфиденциальности (далее – Политика) определяет цели, устанавливает порядок и условия обработки персональных данных, меры, направленные на защиту персональных данных, а также содержит информацию о правах лиц, к которым относятся соответствующие персональные данные, Индивидуальным предпринимателем Богатыревым Тихоном Константиновичем (ОГРНИП 317344300073052 ИНН 343534232543) (далее – Индивидуальный предприниматель).</p>
      <br>
      <p>1.2.Обработка персональных данных осуществляется в соответствии с требованиями Федерального закона Российской Федерации от 27.07.2006 № 152-ФЗ «О персональных данных» и иными нормативными правовыми актами Российской Федерации, регулирующими правоотношения в сфере обработки персональных данных.</p>
      <br>
      <p>1.3.Действие Политики распространяется на все персональные данные субъектов персональных данных, указанных в п. 5.1.1., 5.1.2. Политики, обрабатываемые в Обществе с применением средств автоматизации и без применения таких средств.</p>
      <br>
      <p>1.4.Политика распространяется на все действия, связанные с обработкой персональных данных Индивидуальным предпринимателем на информационном ресурсе, доступ к которому осуществляется по доменному имени www.igra-pads.ru (далее – «Сайт»).</p>
      <br>
      <p>1.5.В случае, если субъект персональных данных возражает против обработки персональных данных в соответствии с Политикой, субъект персональных данных вправе отказаться от использования Сайта или направить соответствующее обращение в адрес Индивидуального предпринимателя. В таком случае предоставление функционала Сайта, включая регистрацию личного кабинета, осуществляться не будет.</p>
      <br>
      <p>1.6.Обработка персональных данных субъекта персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных, а также без получения согласия в случаях, предусмотренных законодательством Российской Федерации.</p>
      <br>
      <p>1.7.Настоящая Политика вступает в силу с момента ее утверждения и действует бессрочно до замены ее новой Политикой.</p>
      <br>
      <p>1.8.Индивидуальный предприниматель вправе в одностороннем порядке изменять условия Политики.</p>
      <br>
      <p>1.9. Ввиду того, что текст Политики находится в свободном доступе в сети «Интернет», субъекту персональных данных
      необходимо самостоятельно следить за изменениями, вносимыми в Политику. В случае противоречия общедоступная версия
      Политики имеет приоритет.</p>

      <p>1.10. Настоящая Политика распространяется на персональные данные, полученные как до, так и после ввода в действие
      настоящей Политики.</p>

      <p>1.11. Внутренний контроль за исполнением требований Политики осуществляется лицом, ответственным за организацию
      обработки персональных данных в Обществе.</p>

      <h2>2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
      <br>

      <p>2.1. Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств
      вычислительной техники.</p>

      <p>2.2. Блокирование — временное прекращение обработки персональных данных (за исключением случаев, если
      обработка необходима для уточнения персональных данных).</p>

      <p>2.3. Безопасность персональных данных — состояние защищенности персональных данных, характеризуемое
      способностью пользователей информационных систем персональных данных, оператора персональных данных, технических
      средств и информационных технологий обеспечить конфиденциальность, целостность и доступность персональных данных при
      их обработке в информационных системах персональных данных.</p>

      <p>2.4. Биометрические персональные данные — данные, которые характеризуют физиологические и биологические
      особенности человека, на основании которых можно установить его личность.</p>

      <p>2.5. Закон — федеральный закон Российской Федерации от 27.07.2006 № 152-ФЗ «О персональных данных».</p>

      <h2>3. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
      <br>

      <p>3.1. Обработка персональных данных Индивидуальным предпринимателем осуществляется для цели предоставления
       функционала Сайта и / или Сервиса, включая следующий функционал: оформление заказов (в том числе бронирование и оплата
       заказов) и возврат денежных средств</p>

      <p>3.2. Обработка персональных данных Индивидуальным предпринимателем также может осуществляться для целей,
указываемых в согласии на обработку персональных данных в форме сбора данных или в интерфейсе Сайта при получении
такого согласия, например, для целей направления маркетинговых сообщений или для связи с Пользователем и / или
Зарегистрированным пользователем по его инициативе.</p>


<h2>4. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
<br>

      <p>4.1. Обработка персональных данных осуществляется Индивидуальным предпринимателем на следующих правовых
        основаниях:</p>

      <p>4.1.1. обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его
персональных данных, которое субъект предоставляет активным действием, в том числе проставляя отметку о согласии в форме
сбора данных и / или в интерфейсе при получении такого согласия;</p>
<p>4.1.2. обработка персональных данных необходима для исполнения договора, стороной которого либо
выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора
по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться
выгодоприобретателем или поручителем;</p>

      <p>4.1.3. обработка персональных данных необходима для осуществления прав и законных интересов оператора или
        третьих лиц при условии, что при этом не нарушаются права и свободы субъекта персональных данных.</p>


        <h2>5. КАТЕГОРИИ ОБРАБАТЫВАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ, КАТЕГОРИИ
            СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
            <br>

      <p>5.1. Индивидуальный предприниматель осуществляет обработку персональных данных следующих субъектов
        персональных данных:</p>

      <p>5.1.1. Физических лиц — Пользователей, в соответствии с целью обработки, указанной в п.п. 3.1., 3.2.</p>
      <p>5.2. Индивидуальный предприниматель обрабатывает следующие категории персональных данных субъектов
        персональных данных:</p>
    <p>5.2.1. В рамках достижения целей, указанных в п. 3.1. Политики – имя (псевдоним или никнейм); номер телефона; адрес
        электронной почты; состав заказов.</p>
    <p>5.2.2. В рамках достижения целей, указанных в п. 3.2. Политики – в отношении, субъектов, указанных в п. 5.1.1: номер
телефона, иные данные, предоставленные в обращении; информация о заказе, указанном в обращении; иные данные,
предоставленные в обращении.</p>
<p>5.2.3. В рамках достижения целей, указанных в п. 2.2 Политики – данные, указанные в форме сбора данных и / или в
    тексте согласия на обработку персональных данных.</p>

    <h2>6. ПОРЯДОК И УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
    <br>
    <p>6.1. Индивидуальный предприниматель осуществляет обработку и обеспечивает безопасность персональных данных
для осуществления возложенных на Индивидуального предпринимателя законодательством Российской Федерации функций,
полномочий и обязанностей в том числе, но не ограничиваясь, в соответствии с Конституцией Российской Федерации,
федеральными законами, в частности Законом, подзаконными актами, другими определяющими случаи и особенности
обработки указанных персональных данных федеральными законами Российской Федерации, а также Гражданским кодексом
Российской Федерации, Законом РФ №2300-1 от 7 февраля 1992 г. «О защите прав потребителей», а также уставом и локальными
актами Общества.</p>
<p>6.2. Индивидуальный предприниматель осуществляет обработку персональных данных с использованием средств
автоматизации, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
использование, передачу (предоставление, доступ, распространение), обезличивание, блокирование, удаление, уничтожение
персональных данных в сроки, необходимые для достижения целей обработки персональных данных</p>
<p>6.3. Обработка персональных данных Субъектов персональных данных осуществляется на основании
пользовательских документов Сайта, если при их сборе не указано иное, а также если иное не предусмотрено законодательством
Российской Федерации, и необходима для исполнения договора (пользовательских документов Сайта), стороной которого либо
выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора
по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться
выгодоприобретателем или поручителем в соответствии с п. 5 ч. 1 ст. 6 Закона в течение срока использования Сайта в качестве
Зарегистрированного пользователя, а также в течение срока исковой давности, т.е. в течение трех (3) лет после удаления личного
кабинета на Сайте на основании п. 7 ч. 1 ст. 6 Закона. После удаления личного кабинета Зарегистрированного пользователя иная
обработка данных, не связанная с хранением в целях п. 7 ч. 1 ст. 6 Закона, не осуществляется Индивидуальным
предпринимателем, а по истечении срока исковой давности при условии отсутствия претензий субъекта и иных основания для
обработки персональных данных такие персональные данные уничтожаются.</p>
<p>6.4. Индивидуальный предприниматель не осуществляет обработку специальных категорий персональных данных и
биометрических персональных данных за исключением случаев, когда обработка персональных данных обусловлена текущими
задачами бизнеса, при обязательном согласии субъекта персональных данных на обработку персональных данных, или является
необходимой в соответствии с требованиями законодательства Российской Федерации.</p>
<p>6.5. Индивидуальный предприниматель вправе поручить обработку персональных данных третьим лицам —
обработчикам — на основании заключаемых с этими лицами договоров и при наличии соответствующего правового основания.
В случае если Индивидуальный предприниматель поручает обработку персональных данных другому лицу, ответственность
перед субъектом персональных данных за действия указанного лица несет Индивидуальный предприниматель. Лицо,
осуществляющее обработку персональных данных по поручению Индивидуального предпринимателя, несет ответственность за
безопасность персональных данных и выполнение требований Закона перед Индивидуальным предпринимателем.</p>
<p>6.6. Лица, осуществляющие обработку персональных данных на основании заключаемого с Индивидуальным
предпринимателем договора (поручения оператора), по условиям заключенных с ними договоров обязуются соблюдать
принципы, правила обработки и защиты персональных данных, предусмотренные действующим законодательством.</p>
<p>6.7. Индивидуальный предприниматель вправе поручить обработку персональных данных, либо осуществить
передачу персональных данных, указанных в пп. 5.2.1. – 5.2.5. Политики, третьим лицам исключительно при наличии
надлежащих оснований обработки, а также при условии, что данные будут передаваться в объеме, минимально необходимом
для достижения указанных целей, и третьи лица примут меры, направленные на соблюдение требований по обеспечению
безопасности персональных данных для достижения целей, указанных в п. 3.1.3, в частности для оплаты и возврата денежных
средств.</p>
<p>6.8. Индивидуальный предприниматель обязывает лиц, допущенных к обработке персональных данных, не раскрывать
третьим лицам и не распространять персональные данные без надлежащих правовых оснований, если иное не предусмотрено
федеральным законом.</p>
<p>6.9. Порядок уничтожения персональных данных на носителях, содержащих персональные данные, в том числе
внешних/съемных электронных носителях, бумажных носителях и в информационных системах персональных данных,
определяются Индивидуальным предпринимателем в своих внутренних документах и локальных нормативных актах.</p>
<p>6.10. Индивидуальный предприниматель не проверяет (не имеет возможности проверить) актуальность и достоверность
предоставляемой субъектами персональных данных сведений, полученных посредством Сайта. Индивидуальный
предприниматель исходит из того, что субъекты персональных данных предоставляют достоверные и достаточные
персональные данные и поддерживают их в актуальном состоянии.</p>
<p>6.11. Индивидуальный предприниматель не контролирует соблюдение условий конфиденциальности и обработки
персональных данных субъектов персональных данных владельцами или пользователями других сайтов, на которые субъект
персональных данных может перейти по ссылкам, доступным на Сайте, и не несет ответственность за действия или бездействия
владельцев или пользователей таких сайтов в области обработки персональных данных и соблюдения конфиденциальности.</p>
<p>6.12. Представители уполномоченных органов власти (в том числе, контролирующих, надзорных, правоохранительных,
дознания и следствия) получают доступ к персональным данным, обрабатываемым Индивидуальным предпринимателем, в
объеме и порядке, установленном законодательством Российской Федерации.</p>
<p>6.13. Индивидуальный предприниматель принимает необходимые правовые, организационные и технические меры для
защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования,
копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении
персональных данных в соответствии с требованиями законодательства Российской Федерации и внутренними документами.
Обеспечение безопасности персональных данных и выполнение Индивидуальным предпринимателем обязанностей, в
соответствии с Законом достигается, в том числе:</p>
<p>6.13.1. Определением угроз безопасности персональных данных при их обработке в информационных системах
    персональных данных.</p>
    <p>6.13.2. Применением организационных и технических мер по обеспечению безопасности персональных данных при их
обработке в информационных системах персональных данных, необходимых для выполнения требований по защите
персональных данных, исполнение которых обеспечивает установленные Правительством Российской Федерации уровни
защищенности персональных данных.</p>
<p>6.13.3. Оценкой эффективности принимаемых мер по обеспечению безопасности персональных данных до ввода в
    эксплуатацию информационной системы персональных данных.</p>
    <p>6.13.4. Назначением лица, ответственного за организацию обработки персональных данных.</p>
    <p>6.13.5. Изданием Индивидуальным предпринимателем документов, определяющих политику в отношении обработки
персональных данных, локальных актов по вопросам обработки персональных данных, определяющих для каждой цели
обработки персональных данных категории и перечень обрабатываемых персональных данных, категории субъектов,
персональные данные которых обрабатываются, способы, сроки их обработки и хранения, порядок уничтожения персональных
данных при достижении целей их обработки или при наступлении иных законных оснований, а также локальных актов,
устанавливающих процедуры, направленные на предотвращение и выявление нарушений законодательства Российской
Федерации, устранение последствий таких нарушений. Такие документы и локальные акты не могут содержать положения,
ограничивающие права субъектов персональных данных, а также возлагающие на Индивидуального предпринимателя не
предусмотренные законодательством Российской Федерации полномочия и обязанности.</p>
<p>6.13.6. Осуществлением внутреннего контроля и (или) аудита соответствия обработки персональных данных Закону и
принятым в соответствии с ним нормативным правовым актам, требованиям к защите персональных данных, политику в
отношении обработки персональных данных, внутренним документам Индивидуального предпринимателя.</p>
<p>6.13.7. Ознакомлением работников Индивидуального предпринимателя или лиц, непосредственно осуществляющих
обработку персональных данных, с положениями законодательства Российской Федерации о персональных данных, в том числе
требованиями к защите персональных данных, документами, определяющими политику в отношении обработки персональных
данных, локальными актами по вопросам обработки персональных данных, и (или) обучение указанных работников/лиц.</p>
<p>6.13.8. Оценка вреда в соответствии с требованиями, установленными уполномоченным органом по защите прав
субъектов персональных данных, который может быть причинен субъектам персональных данных в случае нарушения
настоящего Федерального закона, соотношение указанного вреда и принимаемых оператором мер, направленных на
обеспечение выполнения обязанностей, предусмотренных Законом.</p>
<p>6.13.9. Обнаружением фактов несанкционированного доступа к персональным данным и принятием мер, в том числе
мер по обнаружению, предупреждению и ликвидации последствий компьютерных атак на информационные системы
персональных данных и по реагированию на компьютерные инциденты в них.</p>
<p>6.13.10. Контролем за принимаемыми мерами по обеспечению безопасности персональных данных и уровня
    защищенности информационных систем персональных данных.</p>
    <p>6.14. Индивидуальный предприниматель прекращает обработку персональных данных и уничтожает их в случаях:</p>
    <ul type="square">
        <li>прекращения деятельности Индивидуального предпринимателя;</li>
        <li>прекращения правовых оснований обработки персональных данных и/или достижения целей обработки персональных
            данных;</li>
        <li>отзыва согласия субъекта персональных данных на обработку персональных данных.</li>
    </ul>
    <p>6.15. Хранение персональных данных осуществляется Индивидуальным предпринимателем в форме, позволяющей
определить субъекта персональных данных не дольше, чем этого требуют цели обработки персональных данных и в
соответствии с положениями Закона.</p>
<p>6.16. При сборе персональных данных Индивидуальный предприниматель обеспечивает запись, систематизацию,
накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных граждан Российской Федерации
с использованием баз данных, находящихся на территории Российской Федерации</p>
<p>6.17. Трансграничная передача персональных данных не осуществляется.</p>
<p>6.18. Порядок уничтожения персональных данных на носителях, содержащих персональные данные, в том числе
внешних/съемных электронных носителях, бумажных носителях и в информационных системах персональных данных,
разрабатывается в соответствии с Приказом Федеральной службы по надзору в сфере связи, информационных технологий и
массовых коммуникаций от 28 октября 2022 г. № 179 «Об утверждении Требований к подтверждению уничтожения
персональных данных».</p>


      <h2>7. ФАЙЛЫ COOKIES</h2>
      <br>
      <p>7.1. На Сайте могут использоваться Файлы cookies, приведенные в п. 7.1. Пользовательскими документами Сайта
      может быть предусмотрено использование иных Файлов cookies.</p>

     <table class="policy-table">
        <thead>
          <tr>
            <th>Вид</th>
            <th>Описание</th>
            <th>Цель использования</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>Необходимые файлы cookies</td>
            <td>Эти файлы обеспечивают надлежащую работу Сайта.</td>
            <td>Для обеспечения отображения интерфейсов и их интерактивных компонентов.</td>
          </tr>
          <tr>
            <td>Функциональные файлы cookies</td>
            <td>Сохраняют предпочтения в отношении настроек Сайта.</td>
            <td>Упрощение использования Сайта и улучшение пользовательского опыта.</td>
          </tr>
          <tr>
            <td>Аналитические файлы cookies</td>
            <td>Сохраняют агрегированную информацию об использовании Сайта.</td>
            <td>Для улучшения интерфейсов и планирования развития Сайта.</td>
          </tr>
          <tr>
            <td>Маркетинговые файлы cookies</td>
            <td>Сохраняют информацию о предпочтениях в отношении Сайта.</td>
            <td>Персонализация и оптимизация рекламных коммуникаций.</td>
          </tr>
        </tbody>
      </table>

      <p>7.2. Для отказа от использования Файлов cookies Пользователь и Зарегистрированный пользователь имеет право
      воспользоваться настройками браузера.</p>

      <h2>8. ОТВЕТЫ НА ЗАПРОСЫ СУБЪЕКТОВ НА ДОСТУП К ПЕРСОНАЛЬНЫМ ДАННЫМ</h2>
      <br>
      <p>8.1. При сборе персональных данных Индивидуальный предприниматель обязано предоставить субъекту
        персональных данных по его просьбе информацию, предусмотренную частью 7 статьи 14 Закона.</p>
        <p>8.2. Субъект персональных данных вправе требовать от Индивидуального предпринимателя уточнения его
персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными,
устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также
принимать предусмотренные Законом меры по защите своих прав. Утеря номера телефона, на который зарегистрирован личный
кабинет, равно как и его переход другому лицу, является ответственностью Зарегистрированного пользователя. В этом случае
Зарегистрированному пользователю необходимо обратиться к Индивидуальному предпринимателю для удаления его личного
кабинета. Восстановление доступа к личному кабинету при утере номера телефона невозможно.</p>
<p>8.3. Субъект персональных данных имеет право обратиться к Индивидуальному предпринимателю с требованием
прекратить передачу (распространение, предоставление, доступ) своих персональных данных, ранее разрешенных Субъектом
персональных данных, в части указанных действий для распространения, в случае несоблюдения положений статьи 10.1 Закона
или обратиться с таким требованием в суд. Индивидуальный предприниматель обязан прекратить передачу (распространение,
предоставление, доступ) персональных данных в течение трех рабочих дней с момента получения требования субъекта
персональных данных или в срок, указанный во вступившем в законную силу решении суда, а если такой срок в решении суда
не указан, то в течение трех рабочих дней с момента вступления решения суда в законную силу.</p>
<p>8.4. Субъект персональных данных вправе обжаловать действия или бездействие Общества в Федеральную службу по
надзору в сфере связи, информационных технологий и массовых коммуникаций (Роскомнадзор) или в судебном порядке в
случае, если субъект персональных данных считает, что Индивидуальный предприниматель осуществляет обработку его
персональных данных с нарушением требований Закона или иным образом нарушает его права и свободы.</p>
<p>8.5. Для реализации своих прав и защиты законных интересов субъект персональных данных имеет право обратиться
к Индивидуальному предпринимателю. Для направления официальных запросов в адрес Индивидуального предпринимателя,
необходимо использовать следующие контактные данные_________________________.</p>
<p>8.6. В случае выявления неправомерной обработки персональных данных при обращении субъекта персональных
данных или его представителя либо по запросу субъекта персональных данных или его представителя либо уполномоченного
органа по защите прав субъектов персональных данных оператор обязан осуществить блокирование неправомерно
обрабатываемых персональных данных, относящихся к этому субъекту персональных данных, или обеспечить их блокирование
(если обработка персональных данных осуществляется другим лицом, действующим по поручению оператора) с момента такого
обращения или получения указанного запроса на период проверки.</p>
<p>8.7. В случае выявления неточных персональных данных при обращении субъекта персональных данных или его
представителя либо по их запросу или по запросу уполномоченного органа по защите прав субъектов персональных данных
оператор обязан осуществить блокирование персональных данных, относящихся к этому субъекту персональных данных, или
обеспечить их блокирование (если обработка персональных данных осуществляется другим лицом, действующим по поручению
оператора) с момента такого обращения или получения указанного запроса на период проверки, если блокирование
персональных данных не нарушает права и законные интересы субъекта персональных данных или третьих лиц.</p>
<p>8.8. В случае подтверждения факта неточности персональных данных Индивидуальный предприниматель на
основании сведений, представленных субъектом персональных данных или его представителем либо уполномоченным органом
по защите прав субъектов персональных данных, или иных необходимых документов обязано уточнить персональные данные
либо обеспечить их уточнение (если обработка персональных данных осуществляется другим лицом, действующим по
поручению оператора) в течение семи рабочих дней со дня представления таких сведений и снять блокирование персональных
данных.</p>
<p>8.9. В случае достижения цели обработки персональных данных Индивидуальный предприниматель обязан прекратить
обработку персональных данных или обеспечить ее прекращение (если обработка персональных данных осуществляется другим
лицом, действующим по поручению Индивидуального предпринимателя) и уничтожить персональные данные или обеспечить
их уничтожение (если обработка персональных данных осуществляется другим лицом, действующим по поручению
Индивидуального предпринимателя) в срок, не превышающий тридцати дней с даты достижения цели обработки персональных
данных, если иное не предусмотрено договором, стороной которого, выгодоприобретателем или поручителем по которому
является субъект персональных данных, иным соглашением между Индивидуальным предпринимателем и субъектом
персональных данных либо если Индивидуальный предприниматель не вправе осуществлять обработку персональных данных
без согласия субъекта персональных данных на основаниях, предусмотренных Законом или другими федеральными законами.</p>
<p>8.10. В случае отзыва субъектом персональных данных согласия на обработку его персональных данных
Индивидуальный предприниматель обязан прекратить их обработку или обеспечить прекращение такой обработки (если
обработка персональных данных осуществляется другим лицом, действующим по поручению Индивидуального
предпринимателя) и в случае, если сохранение персональных данных более не требуется для целей обработки персональных
данных, уничтожить персональные данные или обеспечить их уничтожение (если обработка персональных данных
осуществляется другим лицом, действующим по поручению Индивидуального предпринимателя) в срок, не превышающий
тридцати дней с даты поступления указанного отзыва, если иное не предусмотрено договором, стороной которого,
выгодоприобретателем или поручителем по которому является субъект персональных данных, иным соглашением между
Индивидуальный предприниматель и субъектом персональных данных либо если Индивидуальный предприниматель не вправе
осуществлять обработку персональных данных без согласия субъекта персональных данных на основаниях, предусмотренных
Законом или другими федеральными законами.</p>
<p>8.11. В случае обращения субъекта персональных данных к Индивидуальному предпринимателю с требованием о
прекращении обработки персональных данных Индивидуальный предприниматель обязан в срок, не превышающий десяти
рабочих дней с даты получения соответствующего требования, прекратить их обработку или обеспечить прекращение такой
обработки, за исключением случаев, предусмотренных пунктами 2 - 11 части 1 статьи 6, частью 2 статьи 10 и частью 2 статьи
11 Закона. Указанный срок может быть продлен, но не более чем на пять рабочих дней в случае направления оператором в адрес
субъекта персональных данных мотивированного уведомления с указанием причин продления срока предоставления
запрашиваемой информации.</p>
<p>8.12. В случае отсутствия возможности уничтожения персональных данных в течение срока, установленного Законом,
Индивидуальный предприниматель осуществляет блокирование таких персональных данных или обеспечивает их
блокирование (если обработка персональных данных осуществляется другим лицом, действующим по поручению
Индивидуального предпринимателя) и обеспечивает уничтожение персональных данных в срок не более чем шесть месяцев,
если иной срок не установлен федеральными законами.</p>
      </div>
    </div>
  </div>
</template>

<script setup>
const props = defineProps({
  close: Function,
});
</script>

<style scoped>
.privacy-policy-title {
  font-size: 28px;
  font-weight: 800;
}
.modal-overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0);
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 1000;
}

h2 {
    font-size: 26px;
    margin-top: 20px;
  }

  p {
    font-size: 24px;
  }

.modal-content {
  background: white;
  border-radius: 23px;
  padding: 51px 68px 40px 67px;
  font-weight: 400;
  color:#1B2A46;
  max-width: 1213px;
  height: 750px;
  position: relative;
  overflow: hidden;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);
}

.modal-scrollable {
  flex: 1;
  max-height: 750px;
  overflow-y: auto;
  text-align: left;
}

.close-button {
  position: absolute;
  top: -15px;
  right: 15px;
  background: none;
  border: none;
  font-size: 75px;
  cursor: pointer;
  font-weight: 200;
}
</style>
